[
  {
    "id": 1,
    "title": "Software Engineer",
    "company": "Tech Solutions",
    "location": "New York, NY",
    "type": "Full-time",
    "salary": "$90,000 - $120,000",
    "description": "We are seeking a skilled Software Engineer to design, develop, and maintain our web applications. You will be part of a dynamic team working on cutting-edge technology.",
    "responsibilities": "Develop high-quality software design and architecture. Identify, prioritize, and execute tasks in the software development life cycle. Develop tools and applications by producing clean, efficient code.",
    "qualifications": "3+ years of experience in software development. Proficiency in JavaScript, React, and Node.js. Experience with databases and test-driven development.",
    "benefits": "Comprehensive health insurance, 401(k) matching, generous paid time off, flexible work hours, and opportunities for professional development.",
    "postedDate": "2025-09-15",
    "logo": "logo.png"
  },
  {
    "id": 2,
    "title": "Marketing Manager",
    "company": "Creative Agency",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "salary": "$80,000 - $110,000",
    "description": "Lead our marketing campaigns and develop strategies to increase brand awareness and drive growth.",
    "responsibilities": "Develop and implement a cohesive marketing plan to increase brand awareness. Set current and long-term goals for internal teams. Design and review the Marketing department’s budget.",
    "qualifications": "5+ years of experience in marketing. Proven experience with social media and content marketing. Excellent leadership and communication skills.",
    "benefits": "Competitive salary, performance bonuses, health and dental insurance, and a creative work environment.",
    "postedDate": "2025-09-12",
    "logo": "logo.png"
  },
  {
    "id": 3,
    "title": "Data Analyst",
    "company": "Data Insights",
    "location": "Chicago, IL",
    "type": "Contract",
    "salary": "$70,000 - $95,000",
    "description": "Analyze large, complex data sets to identify trends and provide actionable insights for our clients.",
    "responsibilities": "Interpret data, analyze results using statistical techniques. Develop and implement databases, data collection systems, and data analytics strategies. Acquire data from primary or secondary data sources.",
    "qualifications": "2+ years of experience in data analysis. Strong knowledge of SQL and Excel. Experience with data visualization tools like Tableau.",
    "benefits": "Flexible contract terms, competitive hourly rate, and opportunities to work with leading companies.",
    "postedDate": "2025-09-16",
    "logo": "logo.png"
  },
  {
    "id": 4,
    "title": "Project Manager",
    "company": "BuildRight Inc.",
    "location": "Austin, TX",
    "type": "Full-time",
    "salary": "$85,000 - $115,000",
    "description": "Manage key client projects. Plan and oversee projects to ensure they are completed in a timely fashion and within budget.",
    "responsibilities": "Coordinate internal resources and third parties/vendors for the flawless execution of projects. Ensure that all projects are delivered on-time, within scope and within budget. Develop a detailed project plan to track progress.",
    "qualifications": "4+ years of experience in project management. PMP certification is a plus. Excellent client-facing and internal communication skills.",
    "benefits": "Health and wellness programs, retirement savings plan, and generous vacation policy.",
    "postedDate": "2025-09-10",
    "logo": "logo.png"
  },
  {
    "id": 5,
    "title": "Graphic Designer",
    "company": "Visionary Designs",
    "location": "Los Angeles, CA",
    "type": "Part-time",
    "salary": "$45,000 - $65,000",
    "description": "Create engaging and on-brand graphics for a variety of media. The ideal candidate will have a strong portfolio of illustrations or other graphics.",
    "responsibilities": "Study design briefs and determine requirements. Conceptualize visuals based on requirements. Prepare rough drafts and present ideas.",
    "qualifications": "Proven graphic designing experience. A strong portfolio of illustrations or other graphics. Familiarity with design software and technologies (such as InDesign, Illustrator, Dreamweaver, Photoshop).",
    "benefits": "Flexible work schedule, creative work environment, and hourly compensation.",
    "postedDate": "2025-09-17",
    "logo": "logo.png"
  },
  {
    "id": 6,
    "title": "Customer Support Specialist",
    "company": "Support Hub",
    "location": "Remote",
    "type": "Full-time",
    "salary": "$50,000 - $70,000",
    "description": "Join our team to provide top-notch support to our customers. You will be the first point of contact for company inquiries.",
    "responsibilities": "Respond to customer queries in a timely and accurate way, via phone, email or chat. Identify customer needs and help customers use specific features. Analyze and report product malfunctions.",
    "qualifications": "Experience as a Customer Support Specialist or similar CS role. Familiarity with our industry is a plus. Experience using help desk software and remote support tools.",
    "benefits": "Work from home, comprehensive benefits package, and opportunities for advancement.",
    "postedDate": "2025-09-14",
    "logo": "logo.png"
  },
  {
    "id": 7,
    "title": "Senior Python Developer",
    "company": "CodeCrafters",
    "location": "Boston, MA",
    "type": "Full-time",
    "salary": "$120,000 - $150,000",
    "description": "We are looking for a Senior Python Developer to build functional and efficient server-side applications.",
    "responsibilities": "Help design and implement functional requirements. Build efficient back-end features in Python. Implement software enhancements and suggest improvements.",
    "qualifications": "5+ years of experience as a Python Developer. Expertise in at least one popular Python framework (like Django, Flask, or Pyramid). Knowledge of object-relational mapping (ORM).",
    "benefits": "Stock options, competitive salary, unlimited PTO, and health insurance.",
    "postedDate": "2025-09-11",
    "logo": "logo.png"
  },
  {
    "id": 8,
    "title": "UX/UI Designer",
    "company": "Innovate App Co.",
    "location": "Seattle, WA",
    "type": "Full-time",
    "salary": "$95,000 - $125,000",
    "description": "Design intuitive and beautiful user interfaces for our mobile and web applications, ensuring a seamless user experience.",
    "responsibilities": "Gather and evaluate user requirements in collaboration with product managers and engineers. Illustrate design ideas using storyboards, process flows and sitemaps. Design graphical user interface elements, like menus, tabs and widgets.",
    "qualifications": "Proven work experience as a UI/UX Designer or similar role. Portfolio of design projects. Knowledge of wireframe tools (e.g. Wireframe.cc and InVision).",
    "benefits": "Creative freedom, latest design hardware/software, and a collaborative team.",
    "postedDate": "2025-09-18",
    "logo": "logo.png"
  },
  {
    "id": 9,
    "title": "HR Generalist",
    "company": "PeopleFirst Corp.",
    "location": "Denver, CO",
    "type": "Full-time",
    "salary": "$60,000 - $80,000",
    "description": "Undertake a wide range of HR tasks, like organizing trainings, administering employee benefits and leaves, and crafting HR policies.",
    "responsibilities": "Administer compensation and benefit plans. Assist in talent acquisition and recruitment processes. Conduct employee onboarding and help organize training & development initiatives.",
    "qualifications": "Proven experience as an HR Generalist. Understanding of general human resources policies and procedures. Good knowledge of employment/labor laws.",
    "benefits": "Professional development opportunities, excellent benefits, and a positive work culture.",
    "postedDate": "2025-09-08",
    "logo": "logo.png"
  },
  {
    "id": 10,
    "title": "Content Writer",
    "company": "BrightWords Media",
    "location": "Remote",
    "type": "Contract",
    "salary": "$55,000 - $75,000",
    "description": "We're looking for a creative Content Writer to produce high-quality articles, blog posts, and social media content for our clients.",
    "responsibilities": "Research industry-related topics. Write clear marketing copy to promote our products/services. Prepare well-structured drafts using Content Management Systems.",
    "qualifications": "Proven work experience as a Content Writer or similar role. Portfolio of published articles. Excellent writing and editing skills in English.",
    "benefits": "Flexible hours, remote work, and a diverse range of projects.",
    "postedDate": "2025-09-16",
    "logo": "logo.png"
  },
  {
    "id": 11,
    "title": "DevOps Engineer",
    "company": "CloudServe",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "salary": "$130,000 - $160,000",
    "description": "Implement and manage our CI/CD pipeline, and automate our operational processes as much as possible.",
    "responsibilities": "Set up and maintain CI/CD pipelines. Monitor and manage cloud infrastructure. Troubleshoot production issues and coordinate with the development team to streamline code deployment.",
    "qualifications": "Strong experience with cloud services (AWS, Google Cloud, Azure). Experience with Docker, Kubernetes, and Terraform. Proficiency in scripting languages such as Python or Bash.",
    "benefits": "Top-tier salary, stock options, remote work flexibility, and a budget for professional development.",
    "postedDate": "2025-09-17",
    "logo": "logo.png"
  },
  {
    "id": 12,
    "title": "Financial Analyst",
    "company": "MoneyWise Group",
    "location": "Chicago, IL",
    "type": "Full-time",
    "salary": "$75,000 - $95,000",
    "description": "Provide accurate and data-based information on company’s profitability, solvency, stability and liquidity.",
    "responsibilities": "Consolidate and analyze financial data. Assemble and summarize data to structure sophisticated reports on financial status and risks. Develop financial models, conduct benchmarking and process analysis.",
    "qualifications": "Proven working experience as a Financial Analyst. Proficient in spreadsheets, databases, MS Office and financial software applications. Hands on experience with statistical analysis and statistical packages.",
    "benefits": "Performance bonus, 401(k), and comprehensive health benefits.",
    "postedDate": "2025-09-05",
    "logo": "logo.png"
  },
  {
    "id": 13,
    "title": "Social Media Manager",
    "company": "Buzz Factory",
    "location": "New York, NY",
    "type": "Full-time",
    "salary": "$65,000 - $85,000",
    "description": "Develop and implement our social media strategy in order to increase our online presence and improve our marketing and sales efforts.",
    "responsibilities": "Design and implement social media strategy to align with business goals. Generate, edit, publish and share engaging content daily (e.g. original text, photos, videos and news). Monitor SEO and web traffic metrics.",
    "qualifications": "Proven work experience as a Social media manager. Hands on experience in content management. Excellent copywriting skills.",
    "benefits": "Creative and fast-paced environment, health benefits, and team outings.",
    "postedDate": "2025-09-13",
    "logo": "logo.png"
  },
  {
    "id": 14,
    "title": "QA Tester",
    "company": "BugFinders Ltd.",
    "location": "Austin, TX",
    "type": "Contract",
    "salary": "$60,000 - $80,000",
    "description": "Review and analyze system specifications and execute test scripts to ensure software quality.",
    "responsibilities": "Collaborate with QA Engineers to develop effective strategies and test plans. Execute test cases (manual or automated) and analyze results. Evaluate product code according to specifications.",
    "qualifications": "Experience in quality assurance. Familiarity with Agile frameworks and regression testing is a plus. High attention to detail.",
    "benefits": "Opportunity to work on exciting new products, flexible contract, and a great team environment.",
    "postedDate": "2025-09-09",
    "logo": "logo.png"
  },
  {
    "id": 15,
    "title": "Product Manager",
    "company": "NextGen Products",
    "location": "Palo Alto, CA",
    "type": "Full-time",
    "salary": "$140,000 - $170,000",
    "description": "Own the product roadmap and strategy, from conception to launch, for our innovative suite of software tools.",
    "responsibilities": "Define the product vision, strategy, and roadmap. Gather and prioritize product and customer requirements. Work closely with engineering, sales, marketing, and support to ensure revenue and customer satisfaction goals are met.",
    "qualifications": "Proven experience as a Product Manager or similar role. Experience in product lifecycle management. Organizational and leadership abilities.",
    "benefits": "Leadership role, significant impact on product, excellent compensation and equity.",
    "postedDate": "2025-09-18",
    "logo": "logo.png"
  },
  {
    "id": 16,
    "title": "Product Manager",
    "company": "NextGen Products",
    "location": "Palo Alto, CA",
    "type": "Full-time",
    "salary": "$140,000 - $170,000",
    "description": "Own the product roadmap and strategy, from conception to launch, for our innovative suite of software tools.",
    "responsibilities": "Define the product vision, strategy, and roadmap. Gather and prioritize product and customer requirements. Work closely with engineering, sales, marketing, and support to ensure revenue and customer satisfaction goals are met.",
    "qualifications": "Proven experience as a Product Manager or similar role. Experience in product lifecycle management. Organizational and leadership abilities.",
    "benefits": "Leadership role, significant impact on product, excellent compensation and equity.",
    "postedDate": "2025-09-18",
    "logo": "logo.png"
  }
]